{
  "command": "model update-interval",
  "category": "model",
  "search_keywords": [
    "update-interval",
    "refresh"
  ],
  "description": "Set the number of cycles taken between updating the existing plots in the user interface. The default value is 100. This controls how frequently the visual display is refreshed during cycling, affecting both visualization responsiveness and computational performance.",
  "syntax": "model update-interval <i>",
  "keywords": [],
  "notes": [
    "Default update interval: 100 cycles",
    "Controls frequency of plot/visualization updates in the user interface",
    "Lower values: more frequent updates, better visualization responsiveness, slower computation",
    "Higher values: less frequent updates, faster computation, less responsive visualization",
    "Setting to 0 or 1: updates every cycle (very slow for large models)",
    "Large values (1000+): minimal visualization overhead, useful for batch runs",
    "Does not affect calculation results - only visualization frequency",
    "Useful for balancing visualization responsiveness vs. computational speed",
    "For headless/batch runs, larger intervals recommended to maximize performance",
    "For interactive visualization, smaller intervals provide smoother updates"
  ],
  "examples": [
    {
      "command": "model update-interval 100",
      "description": "Set update interval to default (100 cycles)"
    },
    {
      "command": "model update-interval 10",
      "description": "Update plots every 10 cycles for more responsive visualization"
    },
    {
      "command": "model update-interval 1",
      "description": "Update every cycle (slowest, most responsive - for debugging/demonstration)"
    },
    {
      "command": "model update-interval 1000",
      "description": "Update every 1000 cycles for faster computation with minimal visualization"
    },
    {
      "command": "model update-interval 500\nmodel solve ratio 1e-5",
      "description": "Set less frequent updates for faster solve with occasional visualization"
    },
    {
      "command": "model update-interval 50\nmodel cycle 10000",
      "description": "More frequent updates during long cycling for better monitoring"
    },
    {
      "command": "; Interactive visualization\nmodel update-interval 20\nmodel solve\n\n; Batch production run\nmodel update-interval 5000\nmodel solve",
      "description": "Different intervals for interactive vs. batch modes"
    }
  ],
  "python_sdk_alternative": {
    "available": false,
    "workaround": "itasca.command('model update-interval 100') - Python SDK does not provide direct update-interval control. Note: When running via Python SDK, visualization updates may behave differently"
  }
}
