{
  "command": "clump extra",
  "category": "clump",
  "search_keywords": [
    "extra",
    "custom"
  ],
  "description": "Set clump or pebble extra variables. The extra variable can be of any type (number, vector, string) and is associated with the index as if stored in an array. The optional pebble keyword can be given before the optional range to specify that the extra variable will be applied to pebbles. In this case, the range is applied to the pebbles and not to clumps.",
  "syntax": "clump extra <i> <a> <pebble> <range>",
  "keywords": [
    {
      "name": "pebble",
      "syntax": "pebble",
      "description": "Apply extra variable to pebbles instead of clumps. When this keyword is used, the range is applied to pebbles and not to clumps"
    }
  ],
  "notes": [
    "Extra variables can store any data type: numbers, vectors, strings, etc.",
    "Extra variables are indexed like an array (starting from 1)",
    "With pebble keyword: range applies to pebbles, not clumps",
    "Without pebble keyword: range applies to clumps"
  ],
  "examples": [
    {
      "command": "clump extra 1 0 range position-z [z1] [z2]",
      "description": "Set extra variable at index 1 to 0 for all clumps whose centroid's z-coordinate lies between z1 and z2"
    },
    {
      "command": "clump extra 5 (90,100,110)",
      "description": "Set extra variable at index 5 to vector (90,100,110) for all clumps"
    },
    {
      "command": "clump extra 1 'Fred'",
      "description": "Set extra variable at index 1 to string 'Fred' for all clumps"
    },
    {
      "command": "clump extra 3 1.5 range group 'aggregate'",
      "description": "Set extra variable at index 3 to 1.5 for clumps in group 'aggregate'"
    },
    {
      "command": "clump extra 2 100 pebble range id 1 50",
      "description": "Set extra variable at index 2 to 100 for pebbles with IDs 1-50 (range applies to pebbles)"
    }
  ],
  "python_sdk_alternative": {
    "available": true,
    "workaround": "Clump.set_extra(slot, value) for clumps - requires iteration: for c in itasca.clump.list(): c.set_extra(i, value). For pebbles: use Ball.set_extra() on pebble balls"
  }
}
