{
  "command": "clump generate",
  "category": "clump",
  "search_keywords": [
    "generate",
    "packing",
    "count"
  ],
  "description": "Generate non-overlapping clumps. The process ceases when the target number of clumps are created or when the number of attempts to place clumps without overlap is achieved. By default, the clump positions and sizes are drawn from uniform distributions throughout the model domain. As a result, the set of clumps generated is affected by the state of the random-number generator (see model random). The clump size can also be drawn from a Gaussian distribution via the gauss keyword. A number of clump templates can be used during a single clump generate command. The optional range is applied to each clump upon generation and, if the clump does not fall within the range, it is not added to the model and does not affect the stopping criteria. This command contrasts with the clump distribute command where clumps are distributed without regard for overlap until a target porosity is achieved.",
  "syntax": "clump generate <keyword> ... <range>",
  "keywords": [
    {
      "name": "number",
      "syntax": "number <inum>",
      "description": "Specify the number of clumps to be generated (stopping criterion)"
    },
    {
      "name": "templates",
      "syntax": "templates <inum> <stname> <f> ...",
      "description": "Specify the number inum of clump template pairs to be entered followed by the pairs. The pairs are composed of the clump template name and the relative proportion of the clump template to be used during generation. The relative proportions are divided by the sum of the proportions to yield a percentage. If no percentages are specified, then clump templates are drawn equally from those given. If no templates are specified, then they are randomly selected from all clump templates"
    },
    {
      "name": "size",
      "syntax": "size <fsizelow> <fsizehi>",
      "description": "Specify the size range to be used during generation. If fsizehi is not specified, then fsizehi = fsizelow. Default: fsizehi = fsizelow = 1.0. Cannot be given with the fish-distribution keyword"
    },
    {
      "name": "box",
      "syntax": "box <fxmin> <fxmax> <fymin> <fymax> <fzmin> <fzmax>",
      "description": "Clumps will fully fall within this box, such that they will not overlap the box faces or edges. By default, the box is the model domain. z-components are 3D ONLY"
    },
    {
      "name": "tries",
      "syntax": "tries <itries>",
      "description": "Number of tries to fill the specified region with the number of clumps. Default: 20,000"
    },
    {
      "name": "id",
      "syntax": "id <idlow> <idhi>",
      "description": "The ID of the first clump generated is set to idlow that, by default, is the next available ID. idhi, if specified, is used to calculate the number of clumps to generate. Clump IDs are chosen sequentially"
    },
    {
      "name": "diameter",
      "syntax": "diameter",
      "description": "Specify that the linear size used to scale the clumps is the volume equivalent diameter of a disk (2D) or sphere (3D)"
    },
    {
      "name": "density",
      "syntax": "density <fdens>",
      "description": "The clump density. Default: 1"
    },
    {
      "name": "gauss",
      "syntax": "gauss <fcutoff>",
      "description": "Specify that the clump sizes are chosen from a Gaussian distribution with mean value (fsizelow + fsizehi)/2 and standard deviation (fsizehi - fsizelow)/2. The optional fcutoff (default 0.1), multiplied by fsizelow, constitutes the minimum size allowed"
    },
    {
      "name": "fish-distribution",
      "syntax": "fish-distribution <fdist> <a1...an>",
      "description": "The clump sizes are drawn from the distribution represented by the FISH function fdist. Function arguments can be specified as though no function arguments are required. The FISH function must return a floating point value that is the clump size. A FISH distribution cannot be specified with the gauss or size keywords"
    },
    {
      "name": "fish-size",
      "syntax": "fish-size <fsize>",
      "description": "The size used to scale the clumps while generating can be specified by the FISH function with name fsize. The return value of the FISH function should be a linear measure of the clump size and the function should take one argument that is a clump pointer"
    },
    {
      "name": "group",
      "syntax": "group <s> <slot slot> <pebble>",
      "description": "Specify that generated clumps or pebbles are given group name s at slot slot. If the slot keyword is not specified, then the group name is assigned to the slot Default. The optional pebble keyword specifies that the group is assigned to the pebbles and not to the clump"
    },
    {
      "name": "azimuth",
      "syntax": "azimuth <fazlow> <fazhi>",
      "description": "Range of azimuths to rotate the clump template randomly about. An azimuthal rotation is a right-hand rotation about the out-of-plane direction (2D) or z-axis (3D) in degrees"
    },
    {
      "name": "elevation",
      "syntax": "elevation <fellow> <felhi>",
      "description": "Range of elevations to rotate the clump template randomly about (3D ONLY). An elevating rotation is a right-hand rotation about the x-axis in degrees"
    },
    {
      "name": "tilt",
      "syntax": "tilt <ftiltlow> <ftilthi>",
      "description": "Range of tilts to rotate the clump template randomly about (3D ONLY). A tilting rotation is a right-hand rotation about the y-axis in degrees"
    }
  ],
  "notes": [
    "A model domain must be specified prior to clump generation",
    "While cycling, clumps can only be created before cycle point 0 (i.e., when the timestep is calculated)",
    "Non-overlapping generation: process stops when target number reached OR maximum attempts (tries) reached",
    "Clump positions and sizes drawn from uniform distributions by default (affected by random-number generator state)",
    "Contrasts with clump distribute: generate creates non-overlapping clumps until target number, while distribute allows overlaps and stops at target porosity"
  ],
  "examples": [
    {
      "command": "clump generate size 1 2 number 200 template 1 'rock1' 1.0",
      "description": "Generate 200 non-overlapping clumps using template 'rock1' with sizes 1-2"
    },
    {
      "command": "clump generate size 9 18 number 100 range fish testInclude",
      "description": "Generate 100 clumps with sizes 9-18, only adding clumps that satisfy FISH function testInclude"
    },
    {
      "command": "clump generate diameter size 1.5 number 25 box -5.0 5.0 -5.0 5.0 0.0 5.0 templates 2 'dyad' 0.3 'dolos' 0.7 azimuth 45.0 45.0 tilt 90.0 90.0 elevation 45.0 45.0 group 'top1'",
      "description": "Generate 25 clumps with diameter scaling in specified box. Use 30% 'dyad' and 70% 'dolos' templates with fixed orientations (azimuth=45°, tilt=90°, elevation=45°). Assign to group 'top1'"
    },
    {
      "command": "clump generate number 500 size 0.5 1.5 gauss 0.05 templates 3 'rock1' 1 'rock2' 2 'rock3' 1 box -20 20 -20 20 -10 10",
      "description": "Generate 500 clumps with Gaussian size distribution (mean=1.0, std=0.5). Use templates in ratio 1:2:1. Minimum size is 0.05*0.5=0.025"
    }
  ],
  "python_sdk_alternative": {
    "available": false,
    "workaround": "itasca.command('clump generate ...') - Python SDK cannot directly generate clumps with templating system"
  }
}
