{
  "command": "clump tolerance",
  "category": "clump",
  "search_keywords": [
    "tolerance",
    "contact-detection"
  ],
  "description": "Set contact detection tolerances. The size of the extent with which a clump pebble is inserted into the cell space is the minimum extent size plus twice the sum of the following quantities: 1) the maximum interaction distance; 2) the constant contact-detection tolerance (constant - default 0); 3) the maximum length of the minimum extent in all directions multiplied by the extent tolerance (extent - default 0); 4) the maximum component of translational velocity multiplied by the velocity tolerance (velocity - default 0). The pebble will be remapped into the cell space whenever it has translated cumulatively in any direction by this sum from the last time it was mapped into the cell space. Contacts can be created whenever the expanded extents of any pieces (i.e., balls, clump pebbles, or facets) overlap.",
  "syntax": "clump tolerance <keyword> ...",
  "keywords": [
    {
      "name": "constant",
      "syntax": "constant <fctol> <range>",
      "description": "Assign the constant contact-detection tolerance. This is assigned on a per-pebble basis. Default: 0"
    },
    {
      "name": "extent",
      "syntax": "extent <fetol>",
      "description": "Assign the extent contact-detection tolerance. This is a global setting for all pebbles. Default: 0"
    },
    {
      "name": "velocity",
      "syntax": "velocity <fvtol>",
      "description": "Assign the velocity contact-detection tolerance. This is a global setting for all pebbles. Default: 0"
    }
  ],
  "notes": [
    "Contact detection extent = min extent + 2 × (max interaction distance + constant tolerance + max extent × extent tolerance + max velocity component × velocity tolerance)",
    "Pebbles are remapped when they translate cumulatively by this sum from last mapping",
    "Contacts can be created when expanded extents of any pieces overlap (balls, clump pebbles, facets)",
    "IMPORTANT: After model restore, must call 'model clean' before modifying extent tolerances",
    "constant tolerance: per-pebble setting (can use range)",
    "extent tolerance: global setting for all pebbles",
    "velocity tolerance: global setting for all pebbles",
    "See cycle operations: '30.0 - Update Spatial Searching Data Structures' and '35.0 - Create/delete Contacts' for details"
  ],
  "examples": [
    {
      "command": "clump tolerance constant 0.001",
      "description": "Set constant contact-detection tolerance to 0.001 for all clump pebbles"
    },
    {
      "command": "clump tolerance constant 0.005 range id 1 100",
      "description": "Set constant tolerance to 0.005 for pebbles in clumps 1-100"
    },
    {
      "command": "clump tolerance extent 0.01",
      "description": "Set global extent tolerance to 0.01 for all pebbles"
    },
    {
      "command": "clump tolerance velocity 0.1",
      "description": "Set global velocity tolerance to 0.1 for all pebbles"
    },
    {
      "command": "clump tolerance constant 0.001 extent 0.01 velocity 0.1",
      "description": "Set all three tolerance types simultaneously"
    },
    {
      "command": "model restore 'saved_state.sav'\nmodel clean\nclump tolerance extent 0.02",
      "description": "After model restore, clean before modifying extent tolerances"
    }
  ],
  "python_sdk_alternative": {
    "available": false,
    "workaround": "itasca.command('clump tolerance ...') - Python SDK does not provide direct tolerance control"
  }
}
