{
  "command": "model domain",
  "category": "model",
  "search_keywords": [
    "domain",
    "boundary",
    "extent"
  ],
  "description": "Specify the domain boundaries and conditions. DFN fractures only exist within the domain extent. In FLAC3D, zones and structural elements are not aware of the model domain. In PFC, walls, clumps and balls must be inside of the domain and are aware of the domain boundary conditions.",
  "syntax": "model domain <keyword>",
  "keywords": [
    {
      "name": "condition",
      "syntax": "condition <keyword> <keyword> <keyword>",
      "description": "Set the domain boundary conditions. Each domain condition applies to the two box sides that are perpendicular to the direction. The first keyword specifies the condition for the x direction, the second for the y, and the third for the z. If only one keyword is specified, then y and z are set to the same condition as x. The default condition is 'stop'",
      "sub_keywords": [
        {
          "name": "stop",
          "syntax": "stop",
          "description": "If the body centroid falls outside the model domain, the velocity and spin of the body are nulled. For PFC walls, once a facet centroid falls outside the model domain, the velocity and spin are nulled, including any vertex velocities. (Default condition)"
        },
        {
          "name": "reflect",
          "syntax": "reflect",
          "description": "Imparts the opposite sign of the velocity, and the spin is unchanged if the body centroid falls outside the model domain. NOT RECOMMENDED as contact rule since it may induce instabilities. Not compatible with walls intersecting the domain"
        },
        {
          "name": "destroy",
          "syntax": "destroy",
          "description": "Deletes balls, clumps, and wall facets whose individual extents (i.e., an axis-aligned bounding box that tightly encompasses the object) fall outside the model domain"
        },
        {
          "name": "periodic",
          "syntax": "periodic",
          "description": "Applies periodic boundary conditions. When ball or clump centroid falls outside the model domain, they are translated back to the opposite side. 'Ghost' balls and clumps are introduced to ensure contacts are created as if the model was continuous. Not compatible with walls intersecting the domain"
        }
      ]
    },
    {
      "name": "extent",
      "syntax": "extent <fxl> <fxu> <fyl> <fyu> <fzl> <fzu>",
      "description": "Specify the locations of the sides of the domain. Each set of values applies to the lower and upper bound of that dimension of the domain. If fxl and fxu are specified alone, then the domain is a cube"
    }
  ],
  "notes": [
    "DFN fractures only exist within the domain extent",
    "FLAC3D: zones and structural elements are NOT aware of model domain",
    "PFC: walls, clumps, and balls MUST be inside domain and are aware of boundary conditions",
    "Default boundary condition: stop",
    "condition keyword order: x direction, y direction, z direction (optional)",
    "If only one condition specified: y and z set to same as x",
    "stop condition: nulls velocity and spin when centroid exits domain",
    "reflect condition: NOT RECOMMENDED - may cause instabilities, not compatible with walls",
    "destroy condition: deletes objects whose extents fall outside domain",
    "periodic condition: translates objects to opposite side, creates 'ghost' objects, not compatible with walls",
    "extent: if only fxl and fxu specified, creates cubic domain",
    "Domain must be set before creating PFC objects"
  ],
  "examples": [
    {
      "command": "model domain extent -10 10",
      "description": "Create cubic domain from -10 to 10 in all directions"
    },
    {
      "command": "model domain extent -5 5 -10 10 -2 2",
      "description": "Create rectangular domain with different extents in each direction"
    },
    {
      "command": "model domain condition stop",
      "description": "Set stop condition in all directions (default)"
    },
    {
      "command": "model domain condition periodic",
      "description": "Set periodic boundary conditions in all directions"
    },
    {
      "command": "model domain condition periodic stop stop",
      "description": "Periodic in x, stop in y and z directions"
    },
    {
      "command": "model domain condition destroy",
      "description": "Delete objects that exit domain in all directions"
    },
    {
      "command": "model domain extent -20 20\nmodel domain condition periodic\nball generate number 1000 radius 0.5",
      "description": "Setup domain with periodic boundaries before generating balls"
    },
    {
      "command": "model domain extent 0 100 0 100 0 50\nmodel domain condition stop stop destroy",
      "description": "Stop in x and y, destroy in z direction (e.g., particles falling out bottom)"
    },
    {
      "command": "model domain extent -10 10\nmodel domain condition reflect",
      "description": "Reflect condition (not recommended - may cause instabilities)"
    }
  ],
  "python_sdk_alternative": {
    "available": true,
    "python_code": "# Set domain extent\nitasca.set_domain_min(-10, -10, -10)\nitasca.set_domain_max(10, 10, 10)\n\n# Set domain conditions\nitasca.set_domain_condition('x', 'periodic')\nitasca.set_domain_condition('y', 'stop')\nitasca.set_domain_condition('z', 'stop')",
    "notes": "Python SDK provides itasca.set_domain_min(), itasca.set_domain_max(), and itasca.set_domain_condition() functions"
  }
}
