{
  "command": "model mechanical",
  "category": "model",
  "search_keywords": [
    "mechanical",
    "timestep"
  ],
  "description": "Set parameters for a mechanical analysis. The mechanical process is on by default. This command controls mechanical calculation activity, timestep settings, and slave/master coupling for multi-physics simulations.",
  "syntax": "model mechanical <b> <keyword>",
  "keywords": [
    {
      "name": "active",
      "syntax": "active <b>",
      "description": "The mechanical process is on by default. Specify 'active off' to suppress mechanical calculations"
    },
    {
      "name": "dynamic",
      "syntax": "dynamic <b>",
      "description": "Specify the state of dynamic model in 3DEC"
    },
    {
      "name": "list",
      "syntax": "list",
      "description": "Display mechanical calculation-mode information"
    },
    {
      "name": "time-total",
      "syntax": "time-total <f>",
      "description": "f is the accumulated mechanical time for the model. This can be reset to any value, and will continue to be accumulated during cycling after that"
    },
    {
      "name": "slave",
      "syntax": "slave <b>",
      "description": "Specifies that mechanical mode is to be considered a slave, and cycled to equilibrium after each master step has been taken"
    },
    {
      "name": "substep",
      "syntax": "substep <i>",
      "description": "Specifies the maximum number of steps the mechanical process will take when solving with slave on"
    },
    {
      "name": "timestep",
      "syntax": "timestep <keyword>",
      "description": "Configure timestep calculation and behavior",
      "sub_keywords": [
        {
          "name": "automatic",
          "syntax": "automatic",
          "description": "The stable timestep is calculated based on the current stiffnesses and masses of all objects in the system. This is the default setting. In a static mechanical FLAC3D analysis the timestep is arbitrary, and will be set by default to 1.0"
        },
        {
          "name": "fix",
          "syntax": "fix <f>",
          "description": "Set the timestep to be the fixed value f. All timestep calculations are skipped, resulting in performance enhancements. In a FLAC3D static mechanical analysis the timestep can be set to any value, and inertial masses will be scaled to ensure stability. See 'Mechanical Timestep Determination for Numerical Stability' for mass scaling discussion"
        },
        {
          "name": "increment",
          "syntax": "increment <f>",
          "description": "Set the incremental amount that the timestep is allowed to increase from one cycle to the next in automatic mode. Default: f = 1.05. The timestep can decrease by any amount to ensure stability"
        },
        {
          "name": "maximum",
          "syntax": "maximum <f>",
          "description": "Set the maximum allowed timestep. By default, there is no bound to the maximum timestep"
        },
        {
          "name": "safety-factor",
          "syntax": "safety-factor <f>",
          "description": "Set the timestep safety factor, or the factor that is multiplied by the stable timestep calculated when auto mode. Default: f = 1.0 in FLAC3D. If PFC module is loaded, default is f = 0.8. This value is not used for static mechanical FLAC3D analysis"
        },
        {
          "name": "scale",
          "syntax": "scale <f>",
          "description": "Enable timestep scaling in PFC. Timestep scaling is used to reach a static configuration as quickly as possible, regardless of the stress path taken. The inertial masses of each body are scaled based on the stiffnesses, so that the stable timestep is f (or 1.0 if f is not specified). Additionally, the velocity is scaled by the ratio of the old inertial mass to the new inertial mass. In this way, all degrees of freedom have an equal time response, resulting in faster convergence but a meaningless timescale. This value is not used in FLAC3D mechanical timestep calculations"
        },
        {
          "name": "update",
          "syntax": "update <i>",
          "description": "Set the number of cycles between timestep calculation in PFC. In PFC, default: i = 1 (i.e., the timestep is updated every cycle). This value is not used in FLAC3D or 3DEC mechanical timestep calculations"
        }
      ]
    }
  ],
  "notes": [
    "Mechanical process is ON by default",
    "timestep automatic: default mode - calculates stable timestep from stiffnesses and masses",
    "timestep fix: fixed timestep - skips calculations for performance, may scale masses in FLAC3D",
    "timestep increment: controls maximum timestep increase rate (default 1.05), can decrease freely",
    "timestep maximum: sets upper bound on timestep (default: unbounded)",
    "timestep safety-factor: multiplies calculated stable timestep (FLAC3D: 1.0, PFC: 0.8)",
    "timestep scale (PFC only): scales masses for equal time response, faster convergence, meaningless timescale",
    "timestep update (PFC only): frequency of timestep recalculation (default: every cycle)",
    "slave mode: mechanical analysis runs to equilibrium after each master step",
    "substep: max steps for slave mode",
    "time-total: can be reset to any value, accumulates during cycling",
    "FLAC3D static analysis: timestep is arbitrary, default 1.0, masses scaled for stability",
    "See documentation: 'Mechanical Timestep Determination for Numerical Stability' for mass scaling details"
  ],
  "examples": [
    {
      "command": "model mechanical active off",
      "description": "Suppress mechanical calculations (e.g., for thermal-only analysis)"
    },
    {
      "command": "model mechanical active on",
      "description": "Enable mechanical calculations (default)"
    },
    {
      "command": "model mechanical list",
      "description": "Display mechanical calculation-mode information"
    },
    {
      "command": "model mechanical time-total 0.0",
      "description": "Reset accumulated mechanical time to zero"
    },
    {
      "command": "model mechanical timestep automatic",
      "description": "Use automatic timestep calculation (default)"
    },
    {
      "command": "model mechanical timestep fix 1e-6",
      "description": "Set fixed timestep to 1e-6 for performance enhancement"
    },
    {
      "command": "model mechanical timestep increment 1.1",
      "description": "Allow timestep to increase by 10% per cycle"
    },
    {
      "command": "model mechanical timestep maximum 1e-5",
      "description": "Set maximum timestep to 1e-5"
    },
    {
      "command": "model mechanical timestep safety-factor 0.9",
      "description": "Use 90% of calculated stable timestep"
    },
    {
      "command": "model mechanical timestep scale 1.0",
      "description": "Enable timestep scaling in PFC for faster convergence (meaningless timescale)"
    },
    {
      "command": "model mechanical timestep update 10",
      "description": "Update timestep calculation every 10 cycles in PFC"
    },
    {
      "command": "model mechanical slave on\nmodel mechanical substep 1000",
      "description": "Set mechanical mode as slave with max 1000 substeps"
    },
    {
      "command": "model mechanical timestep automatic\nmodel mechanical timestep safety-factor 0.8\nmodel mechanical timestep maximum 1e-4",
      "description": "Configure automatic timestep with safety factor and maximum limit"
    }
  ],
  "python_sdk_alternative": {
    "available": "partial",
    "python_code": "# Get timestep\ndt = itasca.timestep()\n\n# Set fixed timestep\nitasca.set_timestep(1e-6)\n\n# Get accumulated mechanical time\ntime = itasca.mech_age()\n\n# For other settings use command:\nitasca.command('model mechanical timestep safety-factor 0.9')",
    "notes": "Python SDK provides itasca.timestep() to get timestep, itasca.set_timestep() to set fixed timestep, and itasca.mech_age() to get accumulated mechanical time. For advanced settings, use itasca.command()"
  }
}
